app/views/users/_block_album.html.erb

SELECT COUNT(*) FROM "photos" INNER JOIN "albums_photos" ON "photos"."id" = "albums_photos"."photo_id" WHERE "albums_photos"."album_id" = $1  [["album_id", 10]]
---
        <div class="content">
          <div class="number"><%= content.photos.size%></div>