app/views/users/_block_album_tab.html.erb

SELECT "photos".* FROM "photos" INNER JOIN "albums_photos" ON "photos"."id" = "albums_photos"."photo_id" WHERE "albums_photos"."album_id" = $1 ORDER BY "photos"."id" ASC LIMIT $2  [["album_id", 11], ["LIMIT", 1]]
---
      <% end %>
      <%photo = album.photos.first%>

SELECT COUNT(*) FROM "photos" INNER JOIN "albums_photos" ON "photos"."id" = "albums_photos"."photo_id" WHERE "albums_photos"."album_id" = $1  [["album_id", 11]]
---
      <div class="content">
        <div class="number"><%= album.photos.size%></div>