app/views/users/show.html.erb

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."followee_id" = $2  [["follower_id", 2], ["followee_id", 1]]
---
              <div class="col-auto text-secondary tab" name="followers">
                <span name="num-followers" class="font-size-lg"><% @user.followees.size %></span><%= t('.followers_tab')%>