app/views/users/show.html.erb

          <div class="row mx-3 my-1">
            <% @user.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 2]]

          <div class="row my-1">
            <% @user.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = $1  [["user_id", 2]]