app/views/albums/show.html.erb

  Created_at: <%= @album.created_at %> <br>
  Updated_at: <%= @album.updated_at %>
---
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "alululululululu"], ["updated_at", "2020-08-31 02:00:52.960518"], ["id", 1]]