app/controllers/albums_controller.rb

  def edit
    @album = current_user.albums.find(get_album_id)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def update
    value = albums_title
    @album = current_user.album.find(get_album_id)
    @album.title = value
    if @album.update(title: value)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "new title for album 1"], ["updated_at", "2020-08-31 01:55:13.809156"], ["id", 1]]