app/controllers/home_controller.rb

  def newest
    @albums = Album.order(created_at: :desc).limit(4).select(:id, :title)
---
SELECT "albums"."id", "albums"."title" FROM "albums" ORDER BY "albums"."created_at" DESC LIMIT $1  [["LIMIT", 4]]