app/controllers/photos_controller.rb

  def new
    @photo = Photo.new
    @user = User.find(get_user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @photo = Photo.new(photo_params)
    @photo.user_id = get_user_id
    if @photo.save
      redirect_to user_path(get_user_id)
    else
      @user = User.find(get_user_id)
---
INSERT INTO "photos" ("title", "description", "created_at", "updated_at", "user_id", "likes_count", "image") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @photo = Photo.find(get_photo_id)
    @user = User.find(@photo.user_id)
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @photo = Photo.find(get_photo_id)
    @photo.update_attributes(photo_params)
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "photos" SET "description" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["description", "mồn lèo"], ["updated_at", "2020-09-04 08:25:53.792125"], ["id", 6]]

  def destroy
    Photo.destroy(get_photo_id)
---
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 5]]