app/controllers/photos_controller.rb

UPDATE "users" SET "photo_count" = COALESCE("photo_count", 0) - $1 WHERE "users"."id" = $2  [["photo_count", 1], ["id", 1]]
---
  def update
    @photo = current_user.photos.find(get_photo_id)
    @photo.update_attributes(photo_params)

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def destroy
    @photo = current_user.photos.find(get_photo_id)