app/controllers/users_controller.rb

  def show
    @user = User.find(get_user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def discover
    @content_type = get_content
    if @content_type == "photo"
      @content = Photo.includes(:user).order(updated_at: :desc)
    else
      @content = Album.includes(:user, :photos).order(updated_at: :desc)
---
SELECT "photos".* FROM "photos" ORDER BY "photos"."updated_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 4], ["id", 1], ["id", 2]]
SELECT "albums".* FROM "albums" ORDER BY "albums"."updated_at" DESC

  def toggle_follow
    follower_id = get_follower_id
    followee_id = get_followee_id
    follow = Follow.where(follower_id: follower_id, followee_id: followee_id)
    if follow.blank?
      Follow.create(follower_id: follower_id, followee_id: followee_id)
    else
      Follow.destroy_by(follower_id: follower_id, followee_id: followee_id)
---
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."followee_id" = $2  [["follower_id", 30], ["followee_id", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."followee_id" = $2  [["follower_id", 2], ["followee_id", 1]]
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 2], ["followee_id", 1], ["created_at", "2020-09-08 09:38:37.030619"], ["updated_at", "2020-09-08 09:38:37.030619"]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 2]]