app/controllers/users_controller.rb

  def show
    @user = User.find(get_user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def admin
    redirect_to admin_photos_path
    @content_type = get_content
    if @content_type == "photo"
      @content = Photo.where(album_id: nil)
      render "admin_photos"
    else
      if @content_type == "album"
        @content = Album.all
        render "admin_albums"
      else
        @content = User.where.not(id: current_user.id )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]